Revit 2027 API
FamilyLoadedIntoDocumentEventArgs.OriginalFamilyId Property
 The original family id that is overridden by the newly loaded family.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId OriginalFamilyId { get; }
Public ReadOnly Property OriginalFamilyId As ElementId
	Get
public:
property ElementId^ OriginalFamilyId {
	ElementId^ get ();
}
member OriginalFamilyId : ElementId with get
Property Value
ElementId
See Also
Reference
FamilyLoadedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace